000010 IDENTIFICATION                   DIVISION.
000020 PROGRAM-ID.                      TEST-190527.
000030*
000040 ENVIRONMENT                      DIVISION.
000050*
000060 DATA                             DIVISION.
       WORKING-STORAGE SECTION.
       01  WORK-AREA.
020200*     10  TEMP-STR PIC X(051) VALUE "Hello world!.".
020200     10  TEMP-STR PIC X VALUE "Hello world!.".

000080 PROCEDURE                        DIVISION.
000090 MAIN.
000100     DISPLAY TEMP-STR  UPON CONSOLE.
000110     STOP RUN.
